<a href="https://colab.research.google.com/github/constanza1993/coni-icaro/blob/master/Clase_10_y_11.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from sqlalchemy import create_engine
import psycopg2
import pandas as pd
import requests

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

In [2]:
def getPostgreConnector(stringConnection= 'postgresql+psycopg2://postgres:postgres@db-test.cq4syw9xqygb.us-east-1.rds.amazonaws.com:5432/postgres'):
  engine = create_engine(stringConnection)
  return engine

In [3]:
engine = getPostgreConnector()
with engine.connect() as connection:
    result = connection.execute('Select version()')
    print(result.fetchone())

('PostgreSQL 12.5 on x86_64-pc-linux-gnu, compiled by gcc (GCC) 4.8.5 20150623 (Red Hat 4.8.5-11), 64-bit',)

In [12]:
with engine.connect() as connection:
    connection.execute(""" CREATE TABLE conisonzini (
                                                    group_id serial PRIMARY KEY,
                                                    group_name VARCHAR (255) NOT NULL
                                                    );""")
    connection.execute(""" CREATE TABLE coni (
                                                    product_id serial PRIMARY KEY,
                                                    product_name VARCHAR (255) NOT NULL,
                                                    price DECIMAL (11, 2),
                                                    group_id INT NOT NULL,
                                                    FOREIGN KEY (group_id) REFERENCES product_groups (group_id)
                                                  );""")

In [13]:
query_insert_product_group = """
                                INSERT INTO conisonzini (group_name)
                                VALUES
                                  ('Smartphone'),
                                  ('Laptop'),
                                  ('Tablet');
                             """
query_insert_products = """
                            INSERT INTO coni (product_name, group_id,price)
                            VALUES
                              ('Microsoft Lumia', 1, 200),
                              ('HTC One', 1, 400),
                              ('Nexus', 1, 500),
                              ('iPhone', 1, 900),
                              ('HP Elite', 2, 1200),
                              ('Lenovo Thinkpad', 2, 700),
                              ('Sony VAIO', 2, 700),
                              ('Dell Vostro', 2, 800),
                              ('iPad', 3, 700),
                              ('Kindle Fire', 3, 150),
                              ('Samsung Galaxy Tab', 3, 200);
                        """

In [18]:
with engine.connect() as connection:
    connection.execute(query_insert_product_group)
    connection.execute(query_insert_products)

In [19]:
query = """
        SELECT
          group_name,
          AVG (price)
        FROM
          products
        INNER JOIN product_groups USING (group_id)
        GROUP BY
          group_name;
        """

In [20]:
pd.read_sql(sql= query, con= engine, index_col=None)

   group_name    avg
0  Smartphone  500.0
1      Tablet  350.0
2      Laptop  850.0

In [21]:
query = """ 
        SELECT
        product_name,
        price,
        group_name,
        AVG (price) OVER (
          PARTITION BY group_name
        ) as group_average_price
        FROM products
        INNER JOIN product_groups USING (group_id);
      """
pd.read_sql(sql= query, con= engine, index_col=None)

          product_name   price  group_name  group_average_price
0             HP Elite  1200.0      Laptop                850.0
1      Lenovo Thinkpad   700.0      Laptop                850.0
2            Sony VAIO   700.0      Laptop                850.0
3          Dell Vostro   800.0      Laptop                850.0
4      Microsoft Lumia   200.0  Smartphone                500.0
5              HTC One   400.0  Smartphone                500.0
6                Nexus   500.0  Smartphone                500.0
7               iPhone   900.0  Smartphone                500.0
8                 iPad   700.0      Tablet                350.0
9          Kindle Fire   150.0      Tablet                350.0
10  Samsung Galaxy Tab   200.0      Tablet                350.0

In [24]:
query = """ 
        SELECT
        product_name,
        price,
        DENSE_RANK () OVER (
          PARTITION BY group_name
        ORDER BY 
        price
        )
        FROM products
        INNER JOIN product_groups USING (group_id);
      """

In [25]:
pd.read_sql(sql= query, con= engine, index_col=None)

          product_name   price  dense_rank
0            Sony VAIO   700.0           1
1      Lenovo Thinkpad   700.0           1
2          Dell Vostro   800.0           2
3             HP Elite  1200.0           3
4      Microsoft Lumia   200.0           1
5              HTC One   400.0           2
6                Nexus   500.0           3
7               iPhone   900.0           4
8          Kindle Fire   150.0           1
9   Samsung Galaxy Tab   200.0           2
10                iPad   700.0           3

In [35]:
query = """ 
        SELECT
        product_name,
        price,
        group_name,
        MIN (price) OVER (
          PARTITION BY group_name
        ) as min_price_in_group,
        MAX (price) OVER (
          PARTITION BY group_name
        ) as max_price_in_group
        FROM products
        INNER JOIN product_groups USING (group_id);
      """
pd.read_sql(sql= query, con= engine, index_col=None)

          product_name   price  ... min_price_in_group  max_price_in_group
0             HP Elite  1200.0  ...              700.0              1200.0
1      Lenovo Thinkpad   700.0  ...              700.0              1200.0
2            Sony VAIO   700.0  ...              700.0              1200.0
3          Dell Vostro   800.0  ...              700.0              1200.0
4      Microsoft Lumia   200.0  ...              200.0               900.0
5              HTC One   400.0  ...              200.0               900.0
6                Nexus   500.0  ...              200.0               900.0
7               iPhone   900.0  ...              200.0               900.0
8                 iPad   700.0  ...              150.0               700.0
9          Kindle Fire   150.0  ...              150.0               700.0
10  Samsung Galaxy Tab   200.0  ...              150.0               700.0

[11 rows x 5 columns]

In [37]:
query = """ 
        SELECT
        product_name,
        price,
        group_name,
        MAX (price) OVER (
          PARTITION BY group_name
        ) as max_price_in_group
        FROM products
        INNER JOIN product_groups USING (group_id);
      """
pd.read_sql(sql= query, con= engine, index_col=None)

          product_name   price  group_name  max_price_in_group
0             HP Elite  1200.0      Laptop              1200.0
1      Lenovo Thinkpad   700.0      Laptop              1200.0
2            Sony VAIO   700.0      Laptop              1200.0
3          Dell Vostro   800.0      Laptop              1200.0
4      Microsoft Lumia   200.0  Smartphone               900.0
5              HTC One   400.0  Smartphone               900.0
6                Nexus   500.0  Smartphone               900.0
7               iPhone   900.0  Smartphone               900.0
8                 iPad   700.0      Tablet               700.0
9          Kindle Fire   150.0      Tablet               700.0
10  Samsung Galaxy Tab   200.0      Tablet               700.0

In [38]:
query = """ 
        SELECT 
          product_name,
          price,
          group_name
          FROM
            (   SELECT
                product_name,
                price,
                group_name,
                MAX (price) OVER (
                  PARTITION BY group_name
                ) as group_MAX_price
                FROM products
                INNER JOIN product_groups USING (group_id)
            ) as products_with_max
          WHERE group_MAX_price = price
      """
pd.read_sql(sql= query, con= engine, index_col=None)

  product_name   price  group_name
0     HP Elite  1200.0      Laptop
1       iPhone   900.0  Smartphone
2         iPad   700.0      Tablet